lesson_13/files/xmlfile.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:myg="http://www.mygemini.com/schemas/mygemini"
                  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <wsse:Security>
            <wsse:UsernameToken>
                <wsse:Username>******</wsse:Username>
                <wsse:Password>******</wsse:Password>
                <wsse:Nonce>******</wsse:Nonce>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <myg:GetAccountMovementsRequestIo>
            <myg:accountMovementFilterIo>
                <myg:pager>
                    <myg:pageIndex>0</myg:pageIndex>
                    <myg:pageSize>700</myg:pageSize>
                </myg:pager>
                <myg:accountNumber>GE16TB7739436090000001</myg:accountNumber>
                <myg:accountCurrencyCode>GEL</myg:accountCurrencyCode>
                <myg:periodFrom>2025-03-19T00:00:00</myg:periodFrom>
                <myg:periodTo>2025-03-20T23:00:00</myg:periodTo>
            </myg:accountMovementFilterIo>
        </myg:GetAccountMovementsRequestIo>
    </soapenv:Body>
</soapenv:Envelope>